requests/bis/iptv_access_bis.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:s="http://www.w3.org/2001/XMLSchema" xmlns:types="http://www.deltasolutions.ru/om/rt/LyraOmsService/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <SOAP-ENV:Body>
      <types:SubmitOrderRequest>
         <Components>
            <Component>
               <Attributes>
                  <Attribute>
                     <Name>action_code</Name>
                     <Value>1</Value>
                  </Attribute>
                  <Attribute>
                     <Name>address</Name>
                     <Value>г. Курган; ул. КАРБЫШЕВА</Value>
                  </Attribute>
                  <Attribute>
                     <Name>atbr_id</Name>
                     <Value>3</Value>
                  </Attribute>
                  <Attribute>
                     <Name>cfs_spec_id</Name>
                     <Value>iptv_access</Value>
                  </Attribute>
                  <Attribute>
                     <Name>city</Name>
                     <Value>13763</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_id</Name>
                     <Value>31459329</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_name</Name>
                     <Value>ТЕСТ НРИ ДВА</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_phone</Name>
                     <Value>9519364099</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_type</Name>
                     <Value>3</Value>
                  </Attribute>
                  <Attribute>
                     <Name>connection_scheme</Name>
                     <Value>187</Value>
                  </Attribute>
                  <Attribute>
                     <Name>contract_id</Name>
                     <Value>6558856</Value>
                  </Attribute>
                  <Attribute>
                     <Name>delivery_date</Name>
                     <Value>2015-09-11T00:00:00+06:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>department_id</Name>
                     <Value>3401</Value>
                  </Attribute>
                  <Attribute>
                     <Name>flat</Name>
                     <Value>2</Value>
                  </Attribute>
                  <Attribute>
                     <Name>house</Name>
                     <Value>60</Value>
                  </Attribute>
                  <Attribute>
                     <Name>installation_date</Name>
                     <Value>2015-09-11T00:00:00+06:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>installation_interval</Name>
                     <Value>12:00-15:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>installation_order_id</Name>
                     <Value>73776409</Value>
                  </Attribute>
                  <Attribute>
                     <Name>instance_id</Name>
                     <Value>73676413</Value>
                  </Attribute>
                  <Attribute>
                     <Name>jur_eak_id</Name>
                     <Value>9158747</Value>
                  </Attribute>
                  <Attribute>
                     <Name>local_idn_set</Name>
                     <Value>4</Value>
                  </Attribute>
                  <Attribute>
                     <Name>lyra_const_service_id</Name>
                     <Value>36142</Value>
                  </Attribute>
                  <Attribute>
                     <Name>lyra_one_time_service_id</Name>
                     <Value>34645</Value>
                  </Attribute>
                  <Attribute>
                     <Name>main_connection_scheme</Name>
                     <Value>171</Value>
                  </Attribute>
                  <Attribute>
                     <Name>main_instance_id</Name>
                     <Value>1337</Value>
                  </Attribute>
                  <Attribute>
                     <Name>need_installation</Name>
                     <Value>1</Value>
                  </Attribute>
                  <Attribute>
                     <Name>nri_rnabn</Name>
                     <Value>14098120</Value>
                  </Attribute>
                  <Attribute>
                     <Name>order_action_type</Name>
                     <Value>PR</Value>
                  </Attribute>
                  <Attribute>
                     <Name>order_start_date</Name>
                     <Value>2015-09-04T00:00:00+06:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>pack_id</Name>
                     <Value>26900</Value>
                  </Attribute>
                  <Attribute>
                     <Name>password</Name>
                     <Value>0987654321</Value>
                  </Attribute>
                  <Attribute>
                     <Name>prcl_amount</Name>
                     <Value>0</Value>
                  </Attribute>
                  <Attribute>
                     <Name>prcl_id</Name>
                     <Value>640318925</Value>
                  </Attribute>
                  <Attribute>
                     <Name>prcl_quant</Name>
                     <Value>1</Value>
                  </Attribute>
                  <Attribute>
                     <Name>rtpl_id</Name>
                     <Value>36179</Value>
                  </Attribute>
                  <Attribute>
                     <Name>run_billing</Name>
                     <Value>1</Value>
                  </Attribute>
                  <Attribute>
                     <Name>service_receiver</Name>
                     <Value>2</Value>
                  </Attribute>
                  <Attribute>
                     <Name>srls_id</Name>
                     <Value>100015</Value>
                  </Attribute>
                  <Attribute>
                     <Name>srls_quant</Name>
                     <Value>1</Value>
                  </Attribute>
                  <Attribute>
                     <Name>street</Name>
                     <Value>302430</Value>
                  </Attribute>
                  <Attribute>
                     <Name>subs_eak_id</Name>
                     <Value>9158747</Value>
                  </Attribute>
                  <Attribute>
                     <Name>technology</Name>
                     <Value>FTTx</Value>
                  </Attribute>
                  <Attribute>
                     <Name>tx_id</Name>
                     <Value>336437299</Value>
                  </Attribute>
                  <Attribute>
                     <Name>virtual_number</Name>
                     <Value>999999999024</Value>
                  </Attribute>
                  <Attribute>
                     <Name>zip</Name>
                     <Value>640014</Value>
                  </Attribute>
               </Attributes>
            </Component>
         </Components>
         <CommonData>
            <Attributes>
               <Attribute>
                  <Name>main_virtual_number</Name>
                  <Value>123457</Value>
               </Attribute>
            </Attributes>
         </CommonData>
      </types:SubmitOrderRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>